//5.1
//var number = [1,20,3,10,15]
//if let maxNumber = number.max() {
//    print("Максимальный элемент в массиве \(maxNumber)")
//          } else {
//        print("Массив пуст")
//    }
//5.2
//var student1: [String:Any] = ["Имя" : "Вадим", "Фамилия" : "Черкасов", "Возвраст" : "20", "Вес": "70кг", "Рост" : "189см", "Учебное Заведение" : "РКСИ", "Группа" : "ПОКС46W" ]
//var student2: [String:Any] = ["Имя" : "Никита", "Фамилия" : "Головатенко", "Возвраст" : "19", "Вес": "89кг", "Рост" : "185см", "Учебное Заведение" : "РКСИ", "Группа" : "ПОКС46W"  ]
//if let age = student1["Возвраст"] as? String,
//    let age2 = student2["Возвраст"] as? String{
//    if age > age2 {
//        print("Вадим Черкасов старше")
//    }else{
//        print("Никита Головатенко старше")
//    }
//}
//if let weight = student1["Вес"] as? String,
//let weight2 = student2["Вес"] as? String{
//    if weight > weight2 {
//        print("Вадим Черкасов весит больше")
//    }else{
//        print("Никита Головатенко весит больше")
//    }
//}
//if let rost = student1["Рост"] as? String,
//let rost2 = student2["Рост"] as? String{
//    if rost > rost2{
//        print("Вадим Черкасов выше")
//    }else{
//        print("Никита Головатенко выше")
//    }
//}
//5.3
//var sportsmen: [String:Any] = ["Фамилия" : "Черкасов", "Имя" : "Вадим", "Отчество" : "Андреевич", "Вид спорта" : "Футбол" , "Сколько лет занимается" : "21"]
//var sportsmen1: [String:Any] = ["Фамилия" : "Небукин", "Имя" : "Андрей", "Отчество" : "Александрович", "Вид спорта" : "Волейбол" , "Сколько лет занимается" : "20"]
//if let name1 = sportsmen["Сколько лет занимается"] as? String,
//    let name2 = sportsmen1["Сколько лет занимается"] as? String{
//    if name1 > name2 {
//        print("Вадим Черкасов занимается больше")
//    }else {
//        print("Небукин Андрей занимается больше")
//    }
//}

